source/.NET Standard/Unimake.Business.DFe/Servicos/Config/NFSe/AndradasMG.xml

<?xml version="1.0" encoding="utf-8"?>
<Configuracoes>
	<Servicos ID="NFSe">
		<RecepcionarLoteRpsSincrono versao="2.01">
			<Descricao>Recepcionar Lote RPS Sincrono</Descricao>
			<WebEnderecoHomologacao>https://ws.homolog.nfe-cidades.com.br/ws/andradas?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://ws.nfe-cidades.com.br/ws/andradas?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://nfse.abrasf.org.br/RecepcionarLoteRpsSincrono</WebActionHomologacao>
			<WebActionProducao>http://nfse.abrasf.org.br/RecepcionarLoteRpsSincrono</WebActionProducao>
			<SchemaArquivo>nfse-v2-01.xsd</SchemaArquivo>
			<TagAssinatura>Rps</TagAssinatura>
			<TagAtributoID>InfDeclaracaoPrestacaoServico</TagAtributoID>
			<TagLoteAssinatura>EnviarLoteRpsSincronoEnvio</TagLoteAssinatura>
			<TagLoteAtributoID>LoteRps</TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soapenv:Header/><soapenv:Body><nfse:RecepcionarLoteRpsSincronoRequest><nfseCabecMsg>&lt;ns2:cabecalho xmlns=&quot;http://www.w3.org/2000/09/xmldsig#&quot; xmlns:ns2=&quot;http://www.abrasf.org.br/nfse.xsd&quot; versao=&quot;2.01&quot;&gt;&lt;ns2:versaoDados&gt;2.01&lt;/ns2:versaoDados&gt;&lt;/ns2:cabecalho&gt;</nfseCabecMsg><nfseDadosMsg>{xmlBodyScape}</nfseDadosMsg></nfse:RecepcionarLoteRpsSincronoRequest></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:RecepcionarLoteRpsSincronoResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://nfse.abrasf.org.br</TargetNS>
		</RecepcionarLoteRpsSincrono>
		<GerarNfse versao="2.01">
			<Descricao>Gerar Nota Fiscal de Serviço</Descricao>
			<WebEnderecoHomologacao>https://ws.homolog.nfe-cidades.com.br/ws/andradas?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://ws.nfe-cidades.com.br/ws/andradas?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://nfse.abrasf.org.br/GerarNfse</WebActionHomologacao>
			<WebActionProducao>http://nfse.abrasf.org.br/GerarNfse</WebActionProducao>
			<SchemaArquivo>nfse-v2-01.xsd</SchemaArquivo>
			<TagAssinatura>Rps</TagAssinatura>
			<TagAtributoID>InfDeclaracaoPrestacaoServico</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soapenv:Header/><soapenv:Body><nfse:GerarNfseRequest><nfseCabecMsg>&lt;ns2:cabecalho xmlns=&quot;http://www.w3.org/2000/09/xmldsig#&quot; xmlns:ns2=&quot;http://www.abrasf.org.br/nfse.xsd&quot; versao=&quot;2.01&quot;&gt;&lt;ns2:versaoDados&gt;2.01&lt;/ns2:versaoDados&gt;&lt;/ns2:cabecalho&gt;</nfseCabecMsg><nfseDadosMsg>{xmlBodyScape}</nfseDadosMsg></nfse:GerarNfseRequest></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:ConsultarNfseServicoTomadoResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://nfse.abrasf.org.br</TargetNS>
		</GerarNfse>
		<CancelarNfse versao="2.01">
			<Descricao>Cancelar nota fiscal de serviço</Descricao>
			<WebEnderecoHomologacao>https://ws.homolog.nfe-cidades.com.br/ws/andradas?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://ws.nfe-cidades.com.br/ws/andradas?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://nfse.abrasf.org.br/CancelarNfse</WebActionHomologacao>
			<WebActionProducao>http://nfse.abrasf.org.br/CancelarNfse</WebActionProducao>
			<SchemaArquivo>nfse-v2-01.xsd</SchemaArquivo>
			<TagAssinatura>Pedido</TagAssinatura>
			<TagAtributoID>InfPedidoCancelamento</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soapenv:Header/><soapenv:Body><nfse:CancelarNfseRequest><nfseCabecMsg>&lt;ns2:cabecalho xmlns=&quot;http://www.w3.org/2000/09/xmldsig#&quot; xmlns:ns2=&quot;http://www.abrasf.org.br/nfse.xsd&quot; versao=&quot;2.01&quot;&gt;&lt;ns2:versaoDados&gt;2.01&lt;/ns2:versaoDados&gt;&lt;/ns2:cabecalho&gt;</nfseCabecMsg><nfseDadosMsg>{xmlBodyScape}</nfseDadosMsg></nfse:CancelarNfseRequest></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:CancelarNfseResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://nfse.abrasf.org.br</TargetNS>
		</CancelarNfse>
		<SubstituirNfse versao="2.01">
			<Descricao>Substituir nota fiscal de Serviço</Descricao>
			<WebEnderecoHomologacao>https://ws.homolog.nfe-cidades.com.br/ws/andradas?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://ws.nfe-cidades.com.br/ws/andradas?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://nfse.abrasf.org.br/SubstituirNfse</WebActionHomologacao>
			<WebActionProducao>http://nfse.abrasf.org.br/SubstituirNfse</WebActionProducao>
			<SchemaArquivo>nfse-v2-01.xsd</SchemaArquivo>
			<TagAssinatura>Rps</TagAssinatura>
			<TagAtributoID>InfDeclaracaoPrestacaoServico</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<TagExtraAssinatura>Pedido</TagExtraAssinatura>
			<TagExtraAtributoID>InfPedidoCancelamento</TagExtraAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soapenv:Header/><soapenv:Body><nfse:SubstituirNfseRequest><nfseCabecMsg>&lt;ns2:cabecalho xmlns=&quot;http://www.w3.org/2000/09/xmldsig#&quot; xmlns:ns2=&quot;http://www.abrasf.org.br/nfse.xsd&quot; versao=&quot;2.01&quot;&gt;&lt;ns2:versaoDados&gt;2.01&lt;/ns2:versaoDados&gt;&lt;/ns2:cabecalho&gt;</nfseCabecMsg><nfseDadosMsg>{xmlBodyScape}</nfseDadosMsg></nfse:SubstituirNfseRequest></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:SubstituirNfseResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://nfse.abrasf.org.br</TargetNS>
		</SubstituirNfse>
		<ConsultarNfsePorRps versao="2.01">
			<Descricao>Consulta NFSe por RPS</Descricao>
			<WebEnderecoHomologacao>https://ws.homolog.nfe-cidades.com.br/ws/andradas?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://ws.nfe-cidades.com.br/ws/andradas?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://nfse.abrasf.org.br/ConsultarNfsePorRps</WebActionHomologacao>
			<WebActionProducao>http://nfse.abrasf.org.br/ConsultarNfsePorRps</WebActionProducao>
			<SchemaArquivo>nfse-v2-01.xsd</SchemaArquivo>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soapenv:Header/><soapenv:Body><nfse:ConsultarNfsePorRpsRequest><nfseCabecMsg>&lt;ns2:cabecalho xmlns=&quot;http://www.w3.org/2000/09/xmldsig#&quot; xmlns:ns2=&quot;http://www.abrasf.org.br/nfse.xsd&quot; versao=&quot;2.01&quot;&gt;&lt;ns2:versaoDados&gt;2.01&lt;/ns2:versaoDados&gt;&lt;/ns2:cabecalho&gt;</nfseCabecMsg><nfseDadosMsg>{xmlBodyScape}</nfseDadosMsg></nfse:ConsultarNfsePorRpsRequest></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:ConsultarNfsePorRpsResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://nfse.abrasf.org.br</TargetNS>
		</ConsultarNfsePorRps>
		<ConsultarNfseServicoPrestado versao="2.01">
			<Descricao>Consulta NFSe de serviços prestados</Descricao>
			<WebEnderecoHomologacao>https://ws.homolog.nfe-cidades.com.br/ws/andradas?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://ws.nfe-cidades.com.br/ws/andradas?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://nfse.abrasf.org.br/ConsultarNfseServicoPrestado</WebActionHomologacao>
			<WebActionProducao>http://nfse.abrasf.org.br/ConsultarNfseServicoPrestado</WebActionProducao>
			<SchemaArquivo>nfse-v2-01.xsd</SchemaArquivo>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soapenv:Header/><soapenv:Body><nfse:ConsultarNfseServicoPrestadoRequest><nfseCabecMsg>&lt;ns2:cabecalho xmlns=&quot;http://www.w3.org/2000/09/xmldsig#&quot; xmlns:ns2=&quot;http://www.abrasf.org.br/nfse.xsd&quot; versao=&quot;2.01&quot;&gt;&lt;ns2:versaoDados&gt;2.01&lt;/ns2:versaoDados&gt;&lt;/ns2:cabecalho&gt;</nfseCabecMsg><nfseDadosMsg>{xmlBodyScape}</nfseDadosMsg></nfse:ConsultarNfseServicoPrestadoRequest></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:ConsultarNfseServicoPrestadoResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://nfse.abrasf.org.br</TargetNS>
		</ConsultarNfseServicoPrestado>
		<ConsultarNfseServicoTomado versao="2.01">
			<Descricao>Consulta NFSe de serviços tomados</Descricao>
			<WebEnderecoHomologacao>https://ws.homolog.nfe-cidades.com.br/ws/andradas?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://ws.nfe-cidades.com.br/ws/andradas?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://nfse.abrasf.org.br/ConsultarNfseServicoTomado</WebActionHomologacao>
			<WebActionProducao>http://nfse.abrasf.org.br/ConsultarNfseServicoTomado</WebActionProducao>
			<SchemaArquivo>nfse-v2-01.xsd</SchemaArquivo>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soapenv:Header/><soapenv:Body><nfse:ConsultarNfseServicoTomadoRequest><nfseCabecMsg>&lt;ns2:cabecalho xmlns=&quot;http://www.w3.org/2000/09/xmldsig#&quot; xmlns:ns2=&quot;http://www.abrasf.org.br/nfse.xsd&quot; versao=&quot;2.01&quot;&gt;&lt;ns2:versaoDados&gt;2.01&lt;/ns2:versaoDados&gt;&lt;/ns2:cabecalho&gt;</nfseCabecMsg><nfseDadosMsg>{xmlBodyScape}</nfseDadosMsg></nfse:ConsultarNfseServicoTomadoRequest></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:ConsultarNfseServicoTomadoResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://nfse.abrasf.org.br</TargetNS>
		</ConsultarNfseServicoTomado>
		<ConsultarNfseFaixa versao="2.01">
			<Descricao>Consulta NFSe por Faixa</Descricao>
			<WebEnderecoHomologacao>https://ws.homolog.nfe-cidades.com.br/ws/andradas?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://ws.nfe-cidades.com.br/ws/andradas?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://nfse.abrasf.org.br/ConsultarNfsePorFaixa</WebActionHomologacao>
			<WebActionProducao>http://nfse.abrasf.org.br/ConsultarNfsePorFaixa</WebActionProducao>
			<SchemaArquivo>nfse-v2-01.xsd</SchemaArquivo>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soapenv:Header/><soapenv:Body><nfse:ConsultarNfsePorFaixaRequest><nfseCabecMsg>&lt;ns2:cabecalho xmlns=&quot;http://www.w3.org/2000/09/xmldsig#&quot; xmlns:ns2=&quot;http://www.abrasf.org.br/nfse.xsd&quot; versao=&quot;2.01&quot;&gt;&lt;ns2:versaoDados&gt;2.01&lt;/ns2:versaoDados&gt;&lt;/ns2:cabecalho&gt;</nfseCabecMsg><nfseDadosMsg>{xmlBodyScape}</nfseDadosMsg></nfse:ConsultarNfsePorFaixaRequest></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:ConsultarNfsePorFaixaResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://nfse.abrasf.org.br</TargetNS>
		</ConsultarNfseFaixa>
	</Servicos>
</Configuracoes>