src/documetos/porto-seguro/Exemplos XML/ExemploRecepcionarLoteRpsSOAP.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br">
	<soapenv:Header/>
	<soapenv:Body>
		<nfse:RecepcionarLoteRpsRequest>
			<!--Optional:-->
			<nfseCabecMsg>&lt;?xml version="1.0" encoding="UTF-8"?&gt;&lt;cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.02"&gt;&lt;versaoDados&gt;2.02&lt;/versaoDados&gt;&lt;/cabecalho&gt;</nfseCabecMsg>
			<!--Optional:-->
			<nfseDadosMsg><![CDATA[<?xml version="1.0" encoding="utf-8"?><EnviarLoteRpsEnvio xmlns="http://www.abrasf.org.br/nfse.xsd">
	<LoteRps Id="" versao="2.02">
		<NumeroLote></NumeroLote>
		<CpfCnpj>
			<Cnpj></Cnpj>
		</CpfCnpj>
		<InscricaoMunicipal></InscricaoMunicipal>
		<QuantidadeRps></QuantidadeRps>
		<ListaRps>
			<Rps>
	<InfDeclaracaoPrestacaoServico Id="">
		<Rps Id="">
			<IdentificacaoRps>
				<Numero>1</Numero>
				<Serie>8</Serie>
				<Tipo>1</Tipo>
			</IdentificacaoRps>
			<DataEmissao></DataEmissao>
			<Status></Status>
		</Rps>
		<Competencia></Competencia>
		<Servico>
			<Valores>
				<ValorServicos></ValorServicos>
				<ValorDeducoes></ValorDeducoes>
				<ValorPis></ValorPis>
				<ValorCofins></ValorCofins>
				<ValorInss></ValorInss>
				<ValorIr></ValorIr>
				<ValorCsll></ValorCsll>
				<OutrasRetencoes></OutrasRetencoes>
				<ValorIss></ValorIss>
				<Aliquota></Aliquota>
				<DescontoIncondicionado></DescontoIncondicionado>
				<DescontoCondicionado></DescontoCondicionado>
			</Valores>
			<IssRetido></IssRetido>
			<ItemListaServico></ItemListaServico>
			<CodigoCnae></CodigoCnae>
			<CodigoTributacaoMunicipio></CodigoTributacaoMunicipio>
			<Discriminacao></Discriminacao>
			<CodigoMunicipio></CodigoMunicipio>
			<CodigoPais></CodigoPais>
			<ExigibilidadeISS></ExigibilidadeISS>
			<MunicipioIncidencia></MunicipioIncidencia>
		</Servico>
		<Prestador>
			<CpfCnpj>
				<Cnpj></Cnpj>
			</CpfCnpj>
			<InscricaoMunicipal></InscricaoMunicipal>
		</Prestador>
		<Tomador>
			<IdentificacaoTomador>
				<CpfCnpj>
					<Cpf></Cpf>
				</CpfCnpj>
			</IdentificacaoTomador>
			<RazaoSocial></RazaoSocial>
			<Endereco>
				<Endereco></Endereco>
				<Numero></Numero>
				<Bairro></Bairro>
				<CodigoMunicipio></CodigoMunicipio>
				<Uf></Uf>
				<Cep></Cep>
			</Endereco>
			<Contato>
				<Telefone></Telefone>
			</Contato>
		</Tomador>
		<RegimeEspecialTributacao></RegimeEspecialTributacao>
		<OptanteSimplesNacional></OptanteSimplesNacional>
		<IncentivoFiscal></IncentivoFiscal>
	</InfDeclaracaoPrestacaoServico>
	</Rps>
		</ListaRps>
	</LoteRps>
</EnviarLoteRpsEnvio>]]></nfseDadosMsg>
		</nfse:RecepcionarLoteRpsRequest>
	</soapenv:Body>
</soapenv:Envelope>
